Управление ИТ фирмой/Documents/НачислениеПремииПроцентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеПремииПроцентом</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Зарплата</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Управление ИТ фирмой/CalculationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.Календарь</Schedule>
			<ScheduleValue>InformationRegister.Календарь.Resource.Рабочий</ScheduleValue>
			<ScheduleDate>InformationRegister.Календарь.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Управление ИТ фирмой/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Управление ИТ фирмой/Documents/НачислениеПремииПроцентом/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Зарплата.Записывать = Истина;
	Движения.Зарплата.Очистить();
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Очистить();
	
	НачалоРасчетногоПериода = НачалоМесяца(ЗаМесяц);
	КонецРасчетногоПериода = КонецМесяца(ЗаМесяц);
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом;
		Движение.ПериодДействияНачало = НачалоРасчетногоПериода;
		Движение.ПериодДействияКонец = КонецРасчетногоПериода;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.БазовыйПериодНачало = НачалоРасчетногоПериода;
		Движение.БазовыйПериодКонец = КонецРасчетногоПериода;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	РасчетПремииПроцентом();
	
КонецПроцедуры

Процедура РасчетПремииПроцентом()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаБазаЗарплата.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаБазаЗарплата.Сотрудник КАК Сотрудник,
	|	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза
	|ИЗ
	|	РегистрРасчета.Зарплата.БазаЗарплата(&Измерения, &Измерения, , Регистратор = &Регистратор И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Начисления.ПремияПроцентом);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Зарплата[Выборка.НомерСтроки - 1];
		
		Результат = Выборка.СуммаБаза * Процент / 100;
		Результат = Окр(Результат, 2);
		Движение.Сумма = Результат;
		
		Если Результат > 0 Тогда
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Период = Дата;
			Проводка.Сумма = Результат;
			Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Выборка.Сотрудник;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Зарплата.Записать(, Истина);
	
КонецПроцедуры
